   #                                                  Titanic Exercise I
   #### Practice pandas

![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)

First of all, import the needed libraries.

In [1]:
import numpy as np
import pandas as pd

# you will have to import at least another library along the exercise do it in here when the time comes

1. Read in filename and call the variable `titanic`
    - Explore the `titanic` dataset using `info`, `dtypes` & `describe`

In [3]:
filename = "titanic.csv"

In [4]:
#your code
titanic = pd.read_csv(filename)

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

2. Create a separate dataframe with the columns `['name', 'sex', 'age']`, call it `people`

It can be done two ways, do it both!

In [ ]:
#your code
df2 =

3. Print the output of `people` showing the first three rows and the last four rows, using `append`,`tail` and `head`

In [ ]:
#your code

4. Slice the row from 3 to 9, call it `s_titanic`

In [ ]:
#your code

5. Slice the row from 40 to 63 in reverse order, call it `s_titanic_rev`

In [ ]:
#your code

6. Slice the columns from the starting column to `'parch'`, call it `left_columns`

In [ ]:
#your code

7. Slice the columns from `'name'` to `'age'`, call it `middle_columns`

In [ ]:
#your code

8. Slice the columns from `'ticket'` to the end, call it `right_columns`

In [ ]:
#your code

9. What is the name of the oldest person who died in the Titanic? Was he or she travelling alone or had any family travelling with them?

In [ ]:
#your code

In order to give an answer to the second question you should find out which columns give you that info. Usually part of your job as a Data Scientist will be get to know the dataset which you are working with. In this case the columns which give you that info are the following: 
        - 'sibsp' Number of Siblings/Spouses Aboard
        - 'parch' Number of Parents/Children Aboard

In [ ]:
# your code

10. Create the list of 5 random numbers of rows from 0 to the lenght of the dataframe, call it `rows`

ex. `rows = [3,7,99,52,48]` use `random` library

In [ ]:
#your code

This list of numbers are random, could be different.

11. Create the list of three column labels, call it `cols`

In [ ]:
#your code

12. Use both lists `rows` and `cols` to create a new dataframe

In [ ]:
#your code

13. Create a boolean array with the condition of being a woman or a man, using the `sex` column, where **female** is True. Call it `array_fe`

Bonus: Rename the column `"sex"` to `"gender"`

In [ ]:
#your code

14. Filter the `titanic` dataframe with the boolean array, call it `woman_titanic`

In [ ]:
#your code

15. How many woman were younger than 18? Call the variable `minor_wo`

In [ ]:
#your code

16. How many woman that were less than 18 actually died? Call the variable `dead_wo`

In [ ]:
#your code

17. Drop rows with *Nan* in `titanic` with `how='any'` and print the shape

In [ ]:
#your code

18. Drop rows with *Nan* in `titanic` with `how='all'` and print the shape

In [ ]:
#your code

Check in [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) why the shapes are different.

19. Drop columns in `titanic` with more than 1000 missing values and print the columns remaining

In [ ]:
#your code

In [ ]:
#your code

20. Calculate the ratio of missing values at the `boat` column.

In [ ]:
#your code

21.  Group `titanic` by `'pclass'` and aggregate by the columns `age` & `fare`, by `max` and `median` --> `by_class`

In [ ]:
#your code

22. Print the maximum age in each class from `by_class`

In [ ]:
#your code

23. Print the median fare in each class from `by_class`

In [ ]:
#your code

24. Using [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) to count how many women or men survived by class, call it `counted`.

Don't panic and read the documentation!

In [ ]:
#your code

25. Add a new column with the sum of survived men and women, call it `counted['total']`

In [ ]:
#your code

26. Sort `counted` by the `'total'` column. In which class the people survived the more?

In [ ]:
#your code

27. Please, show only the rows using a mask with the following conditions: 
    - They are woman
    - From third class
    - Younger than 30
    - They survived
    
    ¿How many rows fulfill the condition?

In [ ]:
#your code

28. Now, show only the rows using `.loc` with the following conditions: 
    - They are man
    - From first class
    - Older than 50
    - They died
    
    ¿How many rows fulfill the condition?

In [ ]:
#your code

29. Print the uniques values at the column `'name'`

In [ ]:
#your code

30. Find if was there any `name` repeated at the Titanic?

Hint: There were two people with the same name, who?

In [ ]:
#your code

31. Well done! You did it! I can tell you are a real master with Pandas. Please, now save the dataframe as a `.csv` since you will use it in a future exercise `Titanic-Visualisation`. The name of the `.csv` you'll generate should be `titanic_cleaned.csv`.

Use for that aim the following pandas's method: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html

Make sure you use the argument `index = False`.

In [ ]:
#your code